// // якщо число негативне - то вивести: Число негативна
// // якщо число позитивне - то вивести: Число позитивне
// // якщо число 0 - то вивести: Число 0

// let number = 0;

// if (number === 0) {
//   console.log("Ви вибрали 0");
// } else if (number < 0) {
//   console.log("Ви вибрали негативне число");
// } else {
//   console.log("Ви вибрали позитивне число");
// }

//! =========================

// console.log("Hello world");
// console.log("Hello world");
// console.log("Hello world");
// console.log("Hello world");
// console.log("Hello world");
// console.log("Hello world");
// console.log("Hello world");
// console.log("Hello world");
// console.log("Hello world");
// console.log("Hello world");

// for (let i = 1; i <= 10; i += 1) {
//   console.log(`${i} Hello world!`);
// }

// for (старт циклу; умова продовження циклу(поки умова істина - цикл продовжується, як тільки умова стане хибною - цикл завершиться); крок циклу)

// for (let i = 10; i >= 1; i -= 1) {
//   console.log(i);
// }

// ітерація - 1 раз виконання циклу

// потрібно вивести в консоль всі парні числа та цифри від 1 до 100 (2, 4, 6, 8, 10...)
// for/for + if

// let count = 0;
// for (let i = 2; i <= 100; i += 2) {
//   console.log(i);
//   count += 1;
// }

// for (let i = 1; i <= 100; i += 1) {
//   if (i % 2 === 0) {
//     console.log(i);
//   }
//   count += 1;
// }

// console.log(`Ітерацій: ${count}`);

//! =========================

// while - виконується до тих пір поки умова буде true (часто використовується тоді, коли ми не знаємо кількість ітерацій)

// while (умова) { тіло циклу - буде виконуватись тоді, коли умова буде true, якщо умова буде false - цикл завершується }

// let word = "карусель";

// let userWord = prompt("Я загадав слово! Спробуй його вгадати: ");

// while (word !== userWord) {
//   userWord = prompt("Невірно! Спробуй ще раз: ");
// }

// alert("Ти вгадав, вітаю!");

//! =========================

// запитати у користувача його нікнейм. Якщо він ввів будь-який текст - то просто привітатись(Привіт, юзернейм). Але Якщо він ввів слово admin - то заптати пароль. Якщо він ввів пароль admin - то сказати: Ви увійшли в систему. Якщо ж пароль невірний - то питати до тих пір, поки не напише правильний.
