// console.log(Boolean(" ")); // true
// console.log(Boolean("")); // false
// console.log(Boolean(-8.5)); // true
// console.log(Boolean(0)); // false
// console.log(Boolean("0")); // true

// // Логічне НІ(!), АБО(||), І(&&)

// console.log(!0); // true -> Boolean(0) -> !false -> true
// console.log(!"hi"); // false
// console.log(!!null); // false -> Boolean(null) -> !(!false) -> !true -> false

// console.log(0 || 42 || "hello"); // 42
// console.log(null || false || "" || !true || 0); // 0

// console.log("JS" && -1 && !true && 7); // false
// console.log("I" && "love" && "JS" && 42); // 42

//! =============================================
//* Розгалудження (if else, switch case)

// if (умова) {
//     тіло умови, якщо умова істинна(true) - виконуємо тіло умови, якщо умова хибна(false), то не виконуємо
// } else {
//     тіло елсе, виконується тоді, коли іф не спрацював
// }

// let number = Number(prompt("Введіть будь-яке число"));

// if (number > 0) {
//   //   alert("Число " + number + " більше за 0!");
//   alert(`Число ${number} більше за 0!`);
// } else if (number === 0) {
//   alert("Ви ввели 0");
// } else {
//   //   alert("Число " + number + " менше за 0!");
//   alert(`Число ${number} менше за 0!`);
// }

//! ========

// запитайте у користувача юзернейм і пароль. Потім зробіть перевірку на правильність паролю, якщо пароль дорівнює "admin" - то це правильний пароль і потрібно привітатись з юзером(повідомлення Привіт! Імʼя). Якщо пароль неправильний - вивести повідомлення "Неправильний пароль"

//! ========

// let userDrink = Number(
//   prompt("Виберіть напій: 1 - кава, 2 - чай, 3 - мілкшейк")
// );

// if (userDrink === 1) {
//   alert("Ви вибрали каву!");
// } else if (userDrink === 2) {
//   alert("Ви вибрали чай!");
// } else if (userDrink === 3) {
//   alert("Ви вибрали мілкшейк!");
// } else {
//   alert("Такого напою не існує!");
// }

// // switch case відповідає за суворе порівняння кейсів з значенням

// switch (userDrink) {
//   case 1:
//     alert("Ви вибрали каву!");
//     break;
//   case 2:
//     alert("Ви вибрали чай!");
//     break;
//   case 3:
//     alert("Ви вибрали мілкшейк!");
//     break;
//   default:
//     alert("Такого напою не існує!");
// }

//! ========

/*
Потрібно запитати у користовача два числа(в різні промпти), після чого запитати математичну операцію (+, -, /, *). За допомогомою конструкції switch case потрібно визначити який знак вибрав юзер і порахувати вираз.

8
3
-
5

9
3
/
3
*/